Table of Contents
 Class OpeningRectOffsets
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of rectangular opening in IDEA StatiCa Detail
[OpenModelClass(typeof(Opening))]
public class OpeningRectOffsets : Opening
Inheritance
object
OpenObject
OpenElementId
Opening
OpeningRectOffsets
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpeningRectOffsets()
Constructor
public OpeningRectOffsets()
Properties
 OffsetX1
top left X offset
public double OffsetX1 { get; set; }
Property Value
double
 OffsetX2
top right x offset
public double OffsetX2 { get; set; }
Property Value
double
 OffsetY1
right bottom y offset
public double OffsetY1 { get; set; }
Property Value
double
 OffsetY2
right top y offset
public double OffsetY2 { get; set; }
Property Value
double
 X1
Left
public double X1 { get; set; }
Property Value
double
 X2
Right
public double X2 { get; set; }
Property Value
double
 Y1
Bottom
public double Y1 { get; set; }
Property Value
double
 Y2
Top
public double Y2 { get; set; }
Property Value
double
 Edit this page